/****************************************************************************
 *  @Author earthnut
 *  @Email earthnut.dev@outlook.com
 *  @ProjectName color-pen
 *  @FileName t.ts
 *  @CreateDate  周二  04/22/2025
 *  @Description ANSI 转义相关
 ****************************************************************************/

/**   ANSI 转义序列的起始标志符  */
export const esc = '\x1b';

// t 的保留是因为在很多项目中使用，且过多，只能在大版本只进行更替，
/**
 * ## ANSI 转义序列的前缀
 *
 * 英文 Control Sequence Introducer
 */
export const csi = `${esc}[`;

/**
 * 重置终端的样式
 *
 * 重置终端的文本样式，如文本（前景）色、背景色、字体粗细、是否斜体、是否隐藏文本色、是否启用方向显示
 */
export const terminalResetStyle = `${csi}0m`;

/**  适用于含 ANSI 的字符串  */
export const terminalRegExp = new RegExp(
  `(\\x1b\\[${[
    // 光标的显隐
    '((\\?25[hl])',
    // 设置光标的位置及设置终端屏幕滚动的尺寸
    '(\\d+;\\d+[Hr])',
    // 获取光标的位置
    '(6n)',
    // 设置光标移动
    '(\\d{1,4}[ABCD])',
    // 重置属性和清除行或清理屏
    '([012]?[mJK])',
    // 光标到达屏幕的最右侧是否换行
    '(7[hl])',
    // 重置属性、全屏滚动、清理屏幕到底部、清理到行末
    '([mrJK])',
    // 设置属性
    '(([0-4]?[0-9])(;([0-4]?[0-9]+))*m)',
    // 制表符相关
    '([0-6]?W)',
    // 清除制表符相关
    '([0-3]?g))',
  ].join('|')})|(\\x1b[78DMc])`,
  'g',
);
